In [1]:
import pandas as pd

In [5]:
pd.read_excel('../dataset/sample_data.xlsx')

        Year  Stocks T.Bills T.Bonds
0       1928  0.4381  0.0308  0.0084
1       1929  -0.083  0.0316   0.042
2       1930 -0.2512  0.0455  0.0454
3       1931 -0.4384  0.0231 -0.0256
4       1932 -0.0864  0.0107  0.0879
..       ...     ...     ...     ...
78      2006  0.1579  0.0119  0.0298
79      2007  0.0549  0.0988  0.0466
80      2008   -0.37  0.2587   0.016
81      2009  0.2646  -0.149   0.001
82  averages  stocks  tbills   bonds

[83 rows x 4 columns]

In [6]:
pd.read_excel('../dataset/sample_data.xlsx', index_col='Year')

          Stocks T.Bills T.Bonds
Year
1928      0.4381  0.0308  0.0084
1929      -0.083  0.0316   0.042
1930     -0.2512  0.0455  0.0454
1931     -0.4384  0.0231 -0.0256
1932     -0.0864  0.0107  0.0879
...          ...     ...     ...
2006      0.1579  0.0119  0.0298
2007      0.0549  0.0988  0.0466
2008       -0.37  0.2587   0.016
2009      0.2646  -0.149   0.001
averages  stocks  tbills   bonds

[83 rows x 3 columns]

In [ ]:
pd.read_excel('../dataset/sample_data.xlsx', sheet_name='Sheet1' )

### loading txt file

In [8]:
pd.read_csv("../dataset/text.txt")

,employee_id,name,department,salary,join_date,location,performance_score
0,1,Ahmad Bin Rahman,Finance,85000.00,2023-01-15,Kuala Lumpur,4.2
1,2,Nurul Aishah Binti Ismail,HR,72000.00,2022-06-22,Penang,4.8
2,3,Mohd Arif Bin Abdullah,IT,95000.00,2021-11-08,Johor Bahru,4.5
3,4,Siti Fatimah Binti Hassan,Marketing,68000.00,2023-09-03,Melaka,3.9
4,5,Tan Wei Ming,Engineering,110000.00,2020-03-12,Kuala Lumpur,4.7
5,6,Rajesh Kumar,Sales,62000.00,2024-02-18,Petaling Jaya,4.1
6,7,Lee Mei Ling,Finance,78000.00,2022-08-30,Seremban,4.3
7,8,Khairul Nizam Bin Yusof,IT,92000.00,2021-05-27,Ipoh,4.6
8,9,Aminah Binti Zainal,Operations,65000.00,2023-04-11,Kuching,4.0
9,10,David Lim Chee Wei,Engineering,105000.00,2020-12-05,Shah Alam,4.9
10,11,Fatimah Zahra Binti Osman,HR,71000.00,2022-10-19,Kota Kinabalu,4.4
11,12,Azlan Bin Mohd,Marketing,69000.00,2023-07-22,Alor Setar,3.8
12,13,Ng Siew Mei,Sales,64000.00,2024-01-09,Kuala Terengganu,4.2
13,14,Hassan Bin Salleh,Finance,83000.00,2021-09-14,Kuantan,4.5
14,15,Chan Wei Jie,IT,98000.00,2022-02-28,George Town,4.7
15,16,Norhayati Binti Ahmad,Operations,67000.00,2023-11-05,Miri,4.1
16,17,Muhamad Faris Bin Ali,Engineering,115000.00,2020-07-18,Kuala Lumpur,4.8
17,18,Salmah Binti Rahman,HR,73000.00,2022-04-12,Sungai Petani,4.3
18,19,Wong Tuck Fatt,Sales,61000.00,2024-03-30,Batu Pahat,3.9
19,20,Zulkifli Bin Hashim,Marketing,70000.00,2021-12-09,Kuala Lumpur,4.6
20,1,Training Hours Completed,Certifications Earned,Projects Assigned,NaN,NaN,NaN
21,2,45,2,5,NaN,NaN,NaN
22,3,62,3,8,NaN,NaN,NaN
23,4,38,1,4,NaN,NaN,NaN
24,5,85,4,12,NaN,NaN,NaN
25,6,29,1,3,NaN,NaN,NaN